# 🤖 Машина Тьюринга на C++

Комплексная реализация **машины Тьюринга** на C++17 с использованием **ленивых последовательностей (LazySequence)** для создания бесконечной ленты. Проект создан как часть лабораторной работы по курсу «Информатика (организация и поиск данных)».

## ✨ Особенности

- **🚀 Современный C++17**: Использование template-ов, smart pointers, и современных возможностей языка
- **♾️ Ленивая лента**: Бесконечная лента, материализующаяся по мере необходимости с мемоизацией
- **⚙️ Гибкая конфигурация**: Поддержка любых типов для состояний и символов
- **🛡️ Защита от зацикливания**: Настраиваемое ограничение максимального количества шагов
- **🔍 Отладка**: Встроенные средства для визуализации состояния машины
- **✅ Полное тестирование**: Модульные тесты для всех компонентов

## 📚 Теория

**Машина Тьюринга** — это абстрактная вычислительная модель, предложенная Аланом Тьюрингом в 1936 году. Она состоит из:

1. **🗃️ Ленты** — бесконечная последовательность ячеек, каждая содержит символ
2. **🔍 Головки** — устройство чтения/записи, которое может перемещаться по ленте
3. **⚙️ Конечного множества состояний**
4. **📋 Правил переходов** — описывают поведение машины

Наша реализация использует **ленивые последовательности** для эффективного моделирования бесконечной ленты.

## 📁 Структура проекта

```
MachineTuring/
├── MT.h              # 🤖 Основной класс MachineTuring
├── LazySeq.h         # 🔍 Ленивая последовательность
├── Mem.h             # 💾 Класс мемоизации
├── Gen.h             # ⚙️ Класс генератора
├── examples.cpp      # 📚 Примеры использования
├── tests.cpp         # ✅ Модульные тесты
├── Makefile          # 🔨 Сборка проекта
└── README.md         # 📄 Документация
```

## 🚀 Быстрый старт

### 📚 Предварительные требования

- **Компилятор**: g++ с поддержкой C++17 (либо clang++)
- **Инструменты сборки**: make
- **Опционально**: clang-format, cppcheck (для форматирования и статического анализа)

### 💼 Клонирование и сборка

```bash
# Клонирование репозитория
git clone https://github.com/sashaai2006/MachineTuring.git
cd MachineTuring

# Сборка проекта
make all

# Запуск тестов
make run-tests

# Запуск примеров
make run-examples
```

## 👨‍💻 Пример использования

Вот простой пример машины, которая инвертирует бинарную строку:

```cpp
#include "MT.h"
#include <iostream>
#include <vector>

int main() {
    // Создаём машину с пустым символом ' ' и начальным состоянием "START"
    MachineTuring<std::string, char> tm(' ', "START");
    
    // Правила инверсии: 0 -> 1, 1 -> 0
    tm.AddRule("START", '0', "START", '1', Direction::RIGHT);
    tm.AddRule("START", '1', "START", '0', Direction::RIGHT);
    tm.AddRule("START", ' ', "FINAL", ' ', Direction::STAY);  // Остановка
    
    tm.AddFinalState("FINAL");
    
    // Входные данные
    std::vector<char> input = {'1', '0', '1', '1', '0'};
    tm.SetInput(input);
    
    std::cout << "Вход: ";
    for (char c : input) std::cout << c;
    std::cout << std::endl;
    
    // Выполняем машину
    bool success = tm.Run();
    
    if (success) {
        std::cout << "Выход: ";
        auto result = tm.GetTapeSegment(0, input.size());
        for (char c : result) std::cout << c;
        std::cout << std::endl;
        std::cout << "Шагов: " << tm.GetStepCount() << std::endl;
    }
    
    return 0;
}
```

Выход:
```
Вход: 10110
Выход: 01001
Шагов: 6
```

## 📊 Примеры

Проект включает реализации следующих классических алгоритмов машин Тьюринга:

| Пример | Описание | Вход | Выход |
|---------|-------------|-------|-------|
| 🔄 **Инвертер** | Инверсия бинарной строки | `10110` | `01001` |
| 🔍 **Палиндром** | Проверка палиндрома | `abba` | `ACCEPT` |
| ➕ **Сложение** | Сложение в унарном коде | `111+11` | `11111` |

Для запуска всех примеров:
```bash
make run-examples
```

## ✅ Тестирование

Проект полностью покрыт модульными тестами:

- ✔️ **Базовый функционал**: Создание, инициализация
- ✔️ **Переходы**: Правила, состояния, движение
- ✔️ **Лента**: Чтение, запись, сегменты
- ✔️ **Краевые случаи**: Пустой вход, отсутствие правил
- ✔️ **Ограничения**: Лимит шагов, защита от зацикливания

```bash
make run-tests
```

Пример вывода:
```
[Тест] Базовый функционал... PASS
[Тест] Простой переход... PASS
[Тест] Лимит шагов... PASS
Прошло: 11/11 тестов
Все тесты прошли успешно! ✓
```

## 🛠️ Ключевые компоненты

### 🤖 `MachineTuring<State, Symbol>`

Основной класс машины Тьюринга. Template-параметры:
- `State` — тип для состояний (например, `std::string`, `int`)
- `Symbol` — тип для символов на ленте (например, `char`, `int`)

**Основные методы:**

```cpp
// Конструктор
MachineTuring(const Symbol& blank_symbol, const State& initial_state, size_t max_steps = 100000);

// Настройка
void AddRule(const State& from, const Symbol& read, const State& to, const Symbol& write, Direction dir);
void AddFinalState(const State& state);
void SetInput(const std::vector<Symbol>& input, int start_position = 0);

// Выполнение
bool Step();                    // Один шаг
bool Run();                     // До остановки

// Инспекция
const State& GetCurrentState() const;
int GetHeadPosition() const;
Symbol GetSymbolAt(int position) const;
std::vector<Symbol> GetTapeSegment(int start, size_t length) const;

// Отладка
void PrintState(std::ostream& out = std::cout, int tape_window = 20) const;
void Reset();
```

### 🔍 `LazySeq<T, Generator, Mem>`

Ленивая последовательность — основа для бесконечной ленты. Особенности:

- **🚀 Ленивое вычисление**: Элементы генерируются только при обращении
- **💾 Мемоизация**: Однажды вычисленные элементы кешируются
- **♾️ Оптимальность**: O(1) доступ к закешированным элементам

## 💻 Команды Makefile

```bash
# Основные команды
make all          # Собрать всё
make run          # Запустить тесты и примеры
make clean        # Очистить

# Отдельные компоненты
make run-tests    # Только тесты
make run-examples # Только примеры

# Разные сборки
make debug        # Отладочная сборка
make release      # Оптимизированная сборка

# Дополнительные инструменты
make format       # Форматирование кода
make check        # Статический анализ
make help         # Справка
```

## 📈 Производительность

Наша реализация оптимизирована для работы с масштабными задачами:

- 🚀 **Лента**: Миллионы символов (согласно требованиям ЛР)
- ♾️ **Мемоизация**: O(1) повторные обращения
- 🛡️ **Защита**: Конфигурируемые лимиты на количество шагов

## 📚 Литература и ссылки

- 📖 **Оригинальная статья**: Turing, A.M. (1936). "On Computable Numbers"
- 📚 **Классический учебник**: Hopcroft, Ullman "Introduction to Automata Theory"
- 🔗 **Wikipedia**: [Turing Machine](https://en.wikipedia.org/wiki/Turing_machine)
- 📄 **Требования ЛР**: Лабораторная работа №1 по курсу «Информатика»

## 👥 Контрибьюторы

👤 **Автор**: [@sashaai2006](https://github.com/sashaai2006)

## 📝 Лицензия

этот проект создан для образовательных целей в рамках лабораторной работы.

---

Спасибо за интерес к проекту! 🚀

> Машина Тьюринга — это не только теоретическая абстракция, но и мощный инструмент для понимания природы вычислений! 🧠
